lib/tasks/dev.rake

INSERT INTO "global"."admins" ("email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  task add_default_admin: :environment do
    Admin.create!(
        email: 'maria_flor@admin.com',
        password: 'maria_flor.1',
        password_confirmation: 'maria_flor.1'
    )

INSERT INTO "global"."users" ("email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  task add_default_user: :environment do
    User.create!(
        email: 'maria_flor@user.com',
        password: 'maria_flor.1',
        password_confirmation: 'maria_flor.1'
    )